routes/web.php

select * from "stores" where "status" = '1'
---


// Start Queue every 2 min
Route::get('/start',function (){
    $stores = Stores::select("*")
        ->where('status','1')
        ->get();

     ProcessApiStoreJob::dispatch($stores);
      echo $stores; echo '<br />';
});

select * from "products" where "updated_at"::date = '2023-05-29' and "id" = 8168403730725
---
});

// Start Queue every 4 Hours
Route::get('/countProducts',function (){
    $products = Product::select("*")
        ->whereDate('updated_at', '=', Carbon::today()->format('Y-m-d'))
        ->get();
        ProcessCountproductsRevenue::dispatch($products);
      echo $products; echo '<br />';
});